In [1]:
import pandas as pd

In [15]:
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [16]:
df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis="columns",inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [17]:
target=df.Survived
inputs=df.drop("Survived",axis="columns")

In [18]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [19]:
inputs=pd.concat([inputs,dummies],axis="columns")
inputs.drop("Sex",axis="columns",inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [20]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [21]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [22]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(8)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1

In [23]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [24]:
from sklearn.naive_bayes import GaussianNB
model= GaussianNB()

In [25]:
model.fit(X_train,y_train)

GaussianNB()

In [26]:
model.score(X_test,y_test)

0.7877094972067039

In [27]:
X_test[:10]

     Pclass        Age      Fare  female  male
509       3  26.000000   56.4958       0     1
393       1  23.000000  113.2750       1     0
536       1  45.000000   26.5500       0     1
486       1  35.000000   90.0000       1     0
420       3  29.699118    7.8958       0     1
592       3  47.000000    7.2500       0     1
192       3  19.000000    7.8542       1     0
359       3  29.699118    7.8792       1     0
121       3  29.699118    8.0500       0     1
655       2  24.000000   73.5000       0     1

In [28]:
y_test[:10]

509    1
393    1
536    0
486    1
420    0
592    0
192    1
359    1
121    0
655    0
Name: Survived, dtype: int64

In [29]:
model.predict(X_test[:10])

array([0, 1, 0, 1, 0, 0, 1, 1, 0, 0], dtype=int64)

In [30]:
model.predict_proba(X_test[:10])

array([[9.78700379e-01, 2.12996214e-02],
       [1.41527722e-04, 9.99858472e-01],
       [9.25499963e-01, 7.45000371e-02],
       [9.65334903e-04, 9.99034665e-01],
       [9.89956965e-01, 1.00430347e-02],
       [9.90861680e-01, 9.13832049e-03],
       [6.38899861e-02, 9.36110014e-01],
       [7.76805042e-02, 9.22319496e-01],
       [9.89967019e-01, 1.00329807e-02],
       [9.00322661e-01, 9.96773391e-02]])